Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1064DAL169.PIC
      <edc:DCRDef edc:_addr="0x1FC6FF4C" edc:access="-n---n--nnnnnnnnnnnnnnnn-nnnn-nn" edc:cname="ABF2DEVCFG0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x44ffff7b" edc:name="ABF2DEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7fffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TRCEN" edc:desc="Trace Enable" edc:mask="0x1" edc:name="TRCEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Trace features in the CPU are enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Trace features in the CPU are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOOTISA" edc:desc="Boot ISA Selection" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="MIPS32" edc:desc="Boot code and Exception code is MIPS32" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MICROMIPS" edc:desc="Boot code and Exception code is microMIPS" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FECCCON" edc:desc="Dynamic Flash ECC Configuration" edc:mask="0x3" edc:name="FECCCON" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Flash ECC is enabled (ECCCON bits are locked)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DYNAMIC" edc:desc="Dynamic Flash ECC is enabled (ECCCON bits are locked)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF_LOCKED" edc:desc="ECC and Dynamic ECC are disabled (ECCCON bits are locked)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF_UNLOCKED" edc:desc="ECC and Dynamic ECC are disabled (ECCCON bits are writable)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FSLEEP" edc:desc="Flash Sleep Mode" edc:mask="0x1" edc:name="FSLEEP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="VREGS" edc:desc="Flash power down is controlled by the VREGS bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Flash is powered down when the device is in Sleep mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FDBGWP" edc:desc="Debug Page Write Protect" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:mask="0x0" edc:name="FDBGWP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debug Page Write Protect controlled by the flash controller SFR NVMBWP.DBGWP bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debug Page can only be written in Debug mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DBGPER" edc:desc="Debug Mode CPU Access Permission" edc:mask="0x7" edc:name="DBGPER" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG2" edc:desc="Allow CPU access to Permission Group 2 permission regions" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG1" edc:desc="Allow CPU access to Permission Group 1 permission regions" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ALLOW_PG0" edc:desc="Allow CPU access to Permission Group 0 permission regions" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PG_1_0" edc:desc="PG0: Allow PG1: Allow PG2: Deny" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PG_2_0" edc:desc="PG0: Allow PG1: Deny PG2: Allow" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PG_2_1" edc:desc="PG0: Deny PG1: Allow PG2: Allow" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PG_ALL" edc:desc="Allow CPU access to all permission regions" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PG_NONE" edc:desc="Deny CPU access to all permission regions" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:desc="Soft Master Clear Enable" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_POR" edc:desc="MCLR pin generates an emulated POR Reset" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MCLR_NORM" edc:desc="MCLR pin generates a normal system Reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCGAIN" edc:desc="Secondary Oscillator Gain Control bits" edc:mask="0x3" edc:name="SOSCGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GAIN_2X" edc:desc="2x gain setting" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_1_5X" edc:desc="1.5x gain setting" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_0_5X" edc:desc="0.5x gain setting" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_1X" edc:desc="1x gain setting" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_3" edc:desc="Gain level 3 (Highest)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_2" edc:desc="Gain level 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_1" edc:desc="Gain level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_0" edc:desc="Gain level 0 (Lowest)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCBOOST" edc:desc="Secondary Oscillator Boost Kick Start Enable bit" edc:mask="0x1" edc:name="SOSCBOOST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boost the kick start of the oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Normal start of the oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCGAIN" edc:desc="Primary Oscillator Gain Control bits" edc:mask="0x3" edc:name="POSCGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GAIN_2X" edc:desc="2x gain setting" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_1_5X" edc:desc="1.5x gain setting" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_0_5X" edc:desc="0.5x gain setting" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_1X" edc:desc="1x gain setting" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_3" edc:desc="Gain level 3 (Highest)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_2" edc:desc="Gain level 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_1" edc:desc="Gain level 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_LEVEL_0" edc:desc="Gain level 0 (Lowest)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCBOOST" edc:desc="Primary Oscillator Boost Kick Start Enable bit" edc:mask="0x1" edc:name="POSCBOOST" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boost the kick start of the oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Normal start of the oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCFGAIN" edc:desc="Primary Crystal Oscillator Final Gain Control" edc:mask="0x3" edc:name="POSCFGAIN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GAIN_G3" edc:desc="Gain is G3" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_G2" edc:desc="Gain is G2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_G1" edc:desc="Gain is G1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="GAIN_G0" edc:desc="Gain is G0" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCTYPE" edc:desc="Primary Oscillator Type bits" edc:mask="0x3" edc:name="POSCTYPE" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CRYSTAL_12MHZ" edc:desc="12 MHz Crystal used as Primary Oscillator" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="CRYSTAL_24MHZ" edc:desc="24 MHz Crystal used as Primary Oscillator" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="RESONATOR" edc:desc="Resonator used as Primary Oscillator" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CRYSTAL_8MHZ" edc:desc="8 MHz Crystal used as Primary Oscillator" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCAGCRNG" edc:desc="Primary Crystal Oscillator AGC Lock Range bit" edc:mask="0x1" edc:name="POSCAGCRNG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="RANGE_1X" edc:desc="Range 1x" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RANGE_5X" edc:desc="Range 5x" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCAGC" edc:desc="Primary Oscillator Auto Gain Control bit" edc:mask="0x1" edc:name="POSCAGC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="POSC Auto Gain Control Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="POSC Auto Gain Control Disabled/Manual Gain Control Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="EJTAGBEN" edc:desc="EJTAG Boot Enable" edc:mask="0x1" edc:name="EJTAGBEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="REDUCED" edc:desc="Reduced EJTAG functionality" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="NORMAL" edc:desc="Normal EJTAG functionality" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
          <edc:DCRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:DCRFieldDef edc:cname="POSCAGCDLY" edc:desc="Primary Oscillator AGC Gain Search Step setting Time control bits" edc:mask="0x3" edc:name="POSCAGCDLY" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="POSCAGCDLY1" edc:desc="25 ms times POSCAGCRNG x" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="POSCAGCDLY2" edc:desc="6.25 ms times POSCAGCRNG x" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="POSCAGCDLY3" edc:desc="400 ms times POSCAGCRNG x" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="POSCAGCDLY4" edc:desc="100 ms times POSCAGCRNG x" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF50" edc:access="--------------------------------" edc:cname="ABF2DEVCP3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2DEVCP3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF54" edc:access="--------------------------------" edc:cname="ABF2DEVCP2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2DEVCP2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF58" edc:access="--------------------------------" edc:cname="ABF2DEVCP1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2DEVCP1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF5C" edc:access="---n----------------------------" edc:cname="ABF2DEVCP0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x10000000" edc:name="ABF2DEVCP0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x10000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF60" edc:access="--------------------------------" edc:cname="ABF2DEVSIGN3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2DEVSIGN3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF64" edc:access="--------------------------------" edc:cname="ABF2DEVSIGN2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2DEVSIGN2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
